Administration/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "email", "username", "password_digest", "profile_image_file_name", "profile_image_content_type", "profile_image_file_size", "profile_image_updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "first_name" = ?, "email" = ?, "password_digest" = ? WHERE "users"."id" = ?  [["first_name", "Release"], ["email", "Last@One.ca"], ["password_digest", "$2a$10$28s403DOuKgVeCHSnA3Ue.okm93T/N/MIf9ZVHDgVgwR8eCSiKk9y"], ["id", 8]]